app/Controllers/Admin.php

    public function index()
    {
        $userModel = new \App\Models\LoginModel();
        $loggedUserId = session()->get('loggedUser');
        $user = $userModel->find($loggedUserId);
---
SELECT *
FROM `login`
WHERE `login`.`id` = '1'