app/Controllers/User.php

    public function check()
    {
        $validation = $this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Your email is required.',
                    'valid_email' => 'Please enter a valid email address.'
                ]
            ],
            'password' => [
                'rules' => 'required|min_length[6]',
                'errors' => [
                    'required' => 'Your password is required.'

                ]
            ]
        ]);

        if (!$validation) {
            return view('user/login', ['validation' => $this->validator]);
        } else {
        $email = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        $loginModel = new \App\Models\LoginModel();
        $user_info = $loginModel->where('email', $email)->first();
---
SELECT *
FROM `login`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1